export const genCity = () => {
  return JSON.stringify([
    {
      name: "请选择",
      sub: [{ name: "请选择" }],
    },
    {
      name: "北京",
      sub: [
        {
          name: "北京",
          sub: ["大兴区", "东城区", "朝阳区"],
        },
      ],
    },
    {
      name: "四川省",
      sub: [
        {
          name: "成都市",
          sub: ["双流区", "新都区", "成华区", "高新区", "青羊区", "锦江区"],
        },
        {
          name: "遂宁市",
          sub: ["船山区", "大英县", "安居区", "射洪县", "蓬溪县"],
        },
        {
          name: "自贡市",
          sub: ["大安区", "自流井区", "贡井区", "沿滩区", "荣县", "富顺区"],
        },
        {
          name: "泸州市",
          sub: [
            "江阳区",
            "纳溪区",
            "龙马潭区",
            "泸县",
            "合江县",
            "叙永县",
            "古蔺区",
          ],
        },
      ],
    },
    {
      name: "广东省",
      sub: [
        {
          name: "广州市",
          sub: ["越秀区", "荔湾区", "天河区", "海珠区", "黄埔区"],
        },
        {
          name: "深圳市",
          sub: ["福田区", "南山区", "宝安区", "龙岗区"],
        },
        {
          name: "珠海市",
          sub: ["香洲区", "金湾区"],
        },
        {
          name: "汕头市",
          sub: ["金平区", "濠江区", "潮南区", "龙湖区"],
        },
        {
          name: "佛山市",
          sub: ["禅城区", "三水区", "南海区"],
        },
      ],
    },
    {
      name: "上海市",
      sub: [
        {
          name: "上海市",
          sub: [
            "普陀区",
            "静安区",
            "杨浦区",
            "黄浦区",
            "南汇区",
            "嘉定区",
            "徐汇区",
          ],
        },
      ],
    },
  ]);
};
